Repository: zhrispineda/Settings-iOS
Catalog: Preferences/Resources/Localization/CameraSettings/CameraSettings.xcstrings
Source language: en
Languages: ar, bg, bn, ca, cs, da, de, el, es, es_us, fi, fr, fr_ca, gu, he, hi, hr, hu, id, it, ja, kk, kn, ko, lt, ml, mr, ms, nb, nl, or, pa, pl, pt_br, pt_pt, ro, ru, sk, sl, sv, ta, te, th, tr, uk, ur, vi, zh_cn, zh_hk, zh_tw

# CAM_PRESERVE_48MP_CONTROL_FOOTER
source: Preserve the Resolution Control setting, rather than automatically reset.
ar: الاحتفاظ بإعداد التحكم في الدقة بدلاً من إعادة التعيين تلقائيًا.
bg: Запазва настройката Управление на разделителната способност, вместо да възстанови автоматичната.
bn: স্বয়ংক্রিয়ভাবে রিসেট করার পরিবর্তে রেজোলিউশন কন্ট্রোল সংরক্ষিত করে।
ca: Conserva la configuració del control de resolució, en lloc de restablir‑la automàticament.
cs: Místo automatického resetování se zachová nastavení ovládání rozlišení.
da: Behold indstillingen opløsningskontrol i stedet for at nulstille automatisk.
de: Behalte die Einstellung für die Auflösungssteuerung bei, anstatt sie automatisch zurückzusetzen.
el: Διατήρηση της ρύθμισης Στοιχείου ελέγχου ανάλυσης, αντί για αυτόματη επαναφορά.
es: Conserva el ajuste “Control de la resolución” en vez de restablecerlo automáticamente.
es_us: Conserva la configuración del control de resolución en vez de restablecerla automáticamente.
fi: Älä nollaa Tarkkuussäätimet -asetusta automaattisesti.
fr: Conservez la commande de résolution au lieu de réinitialiser les réglages automatiquement.
fr_ca: Applique le réglage « Commande de résolution » plutôt que de rétablir automatiquement les réglages.
gu: ઑટોમૅટિક રીતે રીસેટ કરવાને બદલે રિઝોલ્યૂશન કંટ્રોલ સેટિંગ ટકાવી રાખો.
he: ניתן לשמור את הגדרת פקד הרזולוציה, במקום לאפס אותה באופן אוטומטי.
hi: ऑटोमैटिकली रीसेट करने के बजाय रिज़ोल्यूशन कंट्रोल सेटिंग संरक्षित करें।
hr: Očuvanje postavke Kontrola za razlučivost umjesto automatskog resetiranja.
hu: Megőrizheti a Felbontásvezérlő beállítást, ahelyett, hogy automatikusan alaphelyzetbe állítaná.
id: Pertahankan pengaturan Kontrol Resolusi, alih-alih mengatur ulang secara otomatis.
it: Mantieni l’impostazione “Controllo risoluzione”. L’opzione non verrà reimpostata automaticamente.
ja: 自動的にリセットされず、解像度コントロールの設定を保持します。
kk: Автоматты түрде бастапқы күйге қайтарудың орнына қолданыстағы ажыратымдылықты басқару реттеуін сақтау.
kn: ಸ್ವಯಂಚಾಲಿತವಾಗಿ ರೀಸೆಟ್ ಮಾಡುವ ಬದಲು ರೆಸಲ್ಯೂಷನ್ ಕಂಟ್ರೋಲ್ ಸೆಟ್ಟಿಂಗ್ ಅನ್ನು ಉಳಿಸಿಕೊಳ್ಳಿ.
ko: 카메라를 자동으로 재설정하는 대신 해상도 제어기 설정을 유지합니다.
lt: Išsaugokite „Raiškos valdymo“ nustatymą, užuot automatiškai nustatydami iš naujo.
ml: റെസലൂഷൻ നിയന്ത്രണ ക്രമീകരണത്തെ ഓട്ടോമാറ്റിക്കായി റീസെറ്റ് ചെയ്യുന്നതിനു പകരം സംരക്ഷിക്കൂ.
mr: ऑटोमॅटिकली रीसेट करण्यापेक्षा, रेझोल्यूशन कंट्रोल सेटिंग जतन करा.
ms: Kekalkan seting Kawalan Resolusi, berbanding mereset secara automatik.
nb: Bevar innstillingen for oppløsnings­kontroll i stedet for å nullstille automatisk.
nl: Bewaar de instelling 'Resolutieregelaar' in plaats van deze automatisch opnieuw in te stellen.
or: ସ୍ବୟଂଚାଳିତ ଭାବରେ ରୀସେଟ୍ କରିବା ପରିବର୍ତ୍ତେ ରିଜୋଲ୍ୟୁଶନ୍ କଣ୍ଟ୍ରୋଲ୍ ସେଟିଂ ସଂରକ୍ଷଣ କରନ୍ତୁ।
pa: ਆਟੋਮੈਟਿਕਲੀ ਰੀਸੈੱਟ ਕਰਨ ਦੀ ਬਜਾਏ ਰੈਜ਼ੋਲੂਸ਼ਨ ਕੰਟਰੋਲ ਸੈਟਿੰਗ ਨੂੰ ਰੱਖਿਅਤ ਕਰੋ।
pl: Aplikacja zachowuje ustawienie narzędzia rozdzielczości, zamiast automatycznie je zerować.
pt_br: Preserve o ajuste de Controle da Resolução, em vez de redefini‑lo automaticamente.
pt_pt: Manter a definição de controlo de resolução, em vez de repor automaticamente.
ro: Va fi menținută configurarea Comenzi rezoluție, în locul resetării automate a acesteia.
ru: Настройка «Управление разрешением» будет сохранена, а не сброшена автоматически.
sk: Namiesto automatického resetovania zachová nastavenie ovládania rozlíšenia.
sl: Ohrani nastavitev Krmilna funkcija Ločljivost, namesto da jo samodejno ponastavi.
sv: Behåll inställningarna för upplösningsreglage istället för att automatiskt återställa.
ta: தன்னியக்கமாக மீட்டமைப்பதற்குப் பதிலாக தெளிவுத்திறன் கட்டுப்பாட்டு அமைப்பைத் தக்கவைக்கும்.
te: ఆటోమేటిక్‌గా రీసెట్ చేయడానికి బదులు రిజల్యూషన్ కంట్రోల్ సెట్టింగ్‌ను భద్రపరుస్తుంది.
th: คงการตั้งค่าการควบคุมความละเอียดไว้แทนที่จะรีเซ็ตโดยอัตโนมัติ
tr: Çözünürlük Denetimi ayarını otomatik olarak sıfırlamak yerine korur.
uk: Зберігати значення параметра «Контроль роздільності» замість автоскидання.
ur: آٹومیٹک طریقے سے ری سیٹ کرنے کے بجائے ریزولیوشن کنٹرول سیٹنگ کو محفوظ کریں۔
vi: Bảo lưu cài đặt Điều khiển độ phân giải, thay vì tự động đặt lại.
zh_cn: 保留分辨率控制设置，而非自动重设。
zh_hk: 保留「解像度控制項目」設定，而非自動重設。
zh_tw: 保留「解析度控制項目」設定，而非自動重置。

# CAM_PRESERVE_48MP_CONTROL_SWITCH
source: Resolution Control
ar: التحكم في الدقة
bg: Управление на разделителната способност
bn: রেজোলিউশন কন্ট্রোল
ca: Control de resolució
cs: Ovládání rozlišení
da: Opløsningskontrol
de: Auflösungssteuerung
el: Στοιχείο ελέγχου ανάλυσης
es: Control de la resolución
es_us: Control de resolución
fi: Tarkkuussäätimet
fr: Commande de résolution
fr_ca: Commande de résolution
gu: રિઝોલ્યૂશન કંટ્રોલ
he: פקד רזולוציה
hi: रिज़ोल्यूशन कंट्रोल
hr: Kontrola za razlučivost
hu: Felbontásvezérlő
id: Kontrol Resolusi
it: Controllo risoluzione
ja: 解像度コントロール
kk: Ажыратымдылықты басқару
kn: ರೆಸಲ್ಯೂಷನ್ ಕಂಟ್ರೋಲ್
ko: 해상도 제어기
lt: Raiškos valdymas
ml: റെസലൂഷൻ നിയന്ത്രണം
mr: रेझोल्यूशन कंट्रोल
ms: Kawalan Resolusi
nb: Oppløsnings­kontroll
nl: Resolutieregelaar
or: ରିଜୋଲ୍ୟୁଶନ୍ କଣ୍ଟ୍ରୋଲ୍
pa: ਰੈਜ਼ੋਲੂਸ਼ਨ ਕੰਟਰੋਲ
pl: Narzędzie rozdzielczości
pt_br: Controle da Resolução
pt_pt: Controlo de resolução
ro: Comenzi rezoluție
ru: Управление разрешением
sk: Ovládanie rozlíšenia
sl: Krmilna funkcija Ločljivost
sv: Upplösningsreglage
ta: தெளிவுத்திறன் கட்டுப்பாடு
te: రిజల్యూషన్ కంట్రోల్
th: ควบคุมความละเอียด
tr: Çözünürlük Denetimi
uk: Контроль роздільності
ur: ریزولیوشن کنٹرول
vi: Điều khiển độ phân giải
zh_cn: 分辨率控制
zh_hk: 解像度控制項目
zh_tw: 解析度控制項目

# CAM_PRESERVE_APERTURE_FOOTER
source: Preserve the depth setting, rather than automatically reset.
ar: الاحتفاظ بإعداد العمق بدلاً من إعادة التعيين تلقائيًا.
bg: Запазва настройката за дълбочина, вместо да възстанови автоматичните.
bn: স্বয়ংক্রিয়ভাবে রিসেট করার পরিবর্তে ডেপথ সেটিং সংরক্ষিত করে।
ca: Conserva la configuració de profunditat, en lloc de restablir‑la automàticament.
cs: Nastavení hloubky ostrosti se bude místo automatického resetování zachovávat.
da: Behold dybdeindstillingen fremfor at nulstille automatisk.
de: Behalte die Tiefeneinstellung bei, anstatt sie automatisch zurückzusetzen.
el: Διατήρηση της ρύθμισης βάθους αντί για αυτόματη επαναφορά.
es: Conserva el ajuste de profundidad en vez de restablecerlo automáticamente.
es_us: Conserva la configuración de profundidad, en lugar de restablecerla automáticamente.
fi: Älä nollaa syvyysasetusta automaattisesti.
fr: Conservez le réglage de profondeur au lieu de réinitialiser automatiquement les réglages.
fr_ca: Applique les derniers réglages de profondeur plutôt que de les rétablir automatiquement.
gu: ઑટોમૅટિક રીતે રીસેટ કરવાને બદલે ડેપ્થ સેટિંગ ટકાવી રાખો.
he: ניתן לשמור את הגדרת עומק השדה במקום לאפס אותה באופן אוטומטי.
hi: ऑटोमैटिकली रीसेट करने के बजाय डेप्थ सेटिंग संरक्षित करें।
hr: Očuvanje postavke dubine umjesto automatskog resetiranja.
hu: A mélységbeállítás megőrzése az automatikus alaphelyzetbe állítás helyett.
id: Pertahankan pengaturan kedalaman, alih-alih mengatur ulang secara otomatis.
it: Mantieni l’impostazione di profondità. L’opzione non verrà reimpostata automaticamente.
ja: 自動的にリセットされず、被写界深度設定を保持します。
kk: Автоматты түрде бастапқы күйге қайтарудың орнына қолданыстағы тереңдік реттеуін сақтау.
kn: ಸ್ವಯಂಚಾಲಿತವಾಗಿ ರೀಸೆಟ್ ಮಾಡುವ ಬದಲು ಡೆಪ್ತ್ ಸೆಟ್ಟಿಂಗ್ ಅನ್ನು ಉಳಿಸಿಕೊಳ್ಳಿ.
ko: 카메라를 자동으로 재설정하는 대신 심도 설정을 유지합니다.
lt: Išsaugokite gylio nustatymą, užuot automatiškai nustatydami iš naujo.
ml: ഡെപ്ത് ക്രമീകരണത്തെ ഓട്ടോമാറ്റിക്കായി റീസെറ്റ് ചെയ്യുന്നതിനു പകരം സംരക്ഷിക്കൂ.
mr: ऑटोमॅटिकली रीसेट करण्यापेक्षा, डेप्थ सेटिंग जतन करा.
ms: Kekalkan seting kedalaman, berbanding mereset secara automatik.
nb: Bevar innstillingen for dybdeskarphet i stedet for å nullstille den automatisk.
nl: Bewaar de diepte-instelling in plaats van deze automatisch opnieuw in te stellen.
or: ସ୍ବୟଂଚାଳିତ ଭାବରେ ରୀସେଟ୍ କରିବା ପରିବର୍ତ୍ତେ ଡେପ୍‌ଥ୍‌ ସେଟିଂ ସଂରକ୍ଷଣ କରନ୍ତୁ।
pa: ਆਟੋਮੈਟਿਕਲੀ ਰੀਸੈੱਟ ਕਰਨ ਦੀ ਬਜਾਏ ਡੈਪਥ ਸੈਟਿੰਗ ਨੂੰ ਰੱਖਿਅਤ ਕਰੋ।
pl: Aplikacja zachowuje ustawienie głębi, zamiast automatycznie je zerować.
pt_br: Mantenha os ajustes de profundidade de campo, em vez de redefini-los automaticamente.
pt_pt: Manter a definição de profundidade, em vez de repor automaticamente.
ro: Va fi menținută configurarea de adâncime, în locul resetării automate a acesteia.
ru: Сохранять настройку глубины резкости, а не автоматически сбрасывать ее.
sk: Namiesto automatického resetovania zachová nastavenie hĺbky.
sl: Ohrani nastavitev globine, namesto da jo samodejno ponastavi.
sv: Behåll djupinställningarna istället för att automatiskt återställa.
ta: தன்னியக்கமாக மீட்டமைப்பதற்குப் பதிலாக டெப்த் அமைப்பைத் தக்கவைக்கும்.
te: ఆటోమేటిక్‌గా రీసెట్ చేయడానికి బదులు డెప్త్ సెట్టింగ్‌ను భద్రపరుస్తుంది.
th: คงการตั้งค่าชัดลึกไว้แทนที่จะรีเซ็ตโดยอัตโนมัติ
tr: Derinlik ayarını otomatik olarak sıfırlamak yerine korur.
uk: Зберігати значення параметра глибини різкості замість автоскидання.
ur: آٹومیٹک طریقے سے ری سیٹ کرنے کے بجائے ڈیپتھ سیٹنگ کو محفوظ کریں۔
vi: Bảo lưu cài đặt chiều sâu thay vì tự động đặt lại.
zh_cn: 保留景深设置，而非自动重设。
zh_hk: 保留景深設定，而非自動重設。
zh_tw: 保留景深設定，而非自動重置。

# CAM_PRESERVE_APERTURE_FOOTER_PHOTO_MODE
source: Preserve the depth setting for Photo, Portrait, and Cinematic modes, rather than automatically reset.
ar: الاحتفاظ بإعداد العمق في أنماط صورة وبورتريه وسينمائي، بدلاً من إعادة التعيين تلقائيًا.
bg: Запазва настройката за дълбочина за режимите Снимка, Портрет и Кинематографски, вместо да възстанови автоматичните.
bn: স্বয়ংক্রিয়ভাবে রিসেট করার পরিবর্তে ছবির জন্য ডেপথ সেটিং, পোর্ট্রেট এবং সিনেম্যাটিক মোড সংরক্ষিত করে।
ca: Conserva la configuració de profunditat dels modes de foto, de retrat i de cine, en lloc de restablir‑la automàticament.
cs: Nastavení hloubky ostrosti v režimech Foto, Portrét a Film se bude místo automatického resetování zachovávat.
da: Behold dybdeindstillingen i funktionerne Foto, Portræt og Filmisk fremfor at nulstille automatisk.
de: Behalte die Tiefeneinstellung für die Foto-, Porträt- und Kinomodi bei, anstatt sie automatisch zurückzusetzen.
el: Διατήρηση της ρύθμισης βάθους για τις λειτουργίες «Φωτό», «Πορτρέτο» και «Κινηματογραφικό», αντί για αυτόματη επαναφορά.
es: Conserva el ajuste de profundidad de los modos Foto, Retrato y Cine en lugar de restablecerlo automáticamente.
es_us: Conserva la configuración de profundidad para los modos Foto, Retrato y Cine, en lugar de restablecerla automáticamente.
fi: Älä nollaa syvyysasetusta Kuva-, Muotokuva- ja Elokuvallinen-tiloissa, vaan säilytä viimeksi käytetty asetus.
fr: Conserve le réglage de profondeur des modes Photo, Portrait et Cinématique au lieu de le réinitialiser automatiquement.
fr_ca: Applique les derniers réglages de profondeur pour les modes Photo, Portrait et Cinéma plutôt que de les rétablir automatiquement.
gu: ઑટોમૅટિક રીતે રીસેટ કરવાને બદલે ફોટો, પોર્ટ્રેટ અને સિનેમૅટિક મોડ માટે ડેપ્થ સેટિંગ ટકાવી રાખો.
he: ניתן לשמור את הגדרת עומק השדה עבור מצבי ״תמונה״, ״פורטרט״ ו״קולנועי״, במקום לאפס אותה באופן אוטומטי.
hi: ऑटोमैटिकली रीसेट करने के बजाए तस्वीर, पोर्ट्रेट और सिनेमैटिक मोड के लिए डेप्थ सेटिंग संरक्षित करें।
hr: Očuvanje postavke dubine za modove Foto, Portret i Filmski, umjesto automatskog prebacivanja.
hu: A Fotó, a Portré és a Filmszerű mód mélységbeállításának megőrzése az automatikus alaphelyzetbe állítás helyett.
id: Pertahankan pengaturan kedalaman untuk mode Foto, Potret, dan Sinematik, alih-alih mengatur ulang secara otomatis.
it: Mantieni l’impostazione di profondità per le modalità Foto, Ritratto e Cinema. L’opzione non verrà reimpostata automaticamente.
ja: “写真”の被写界深度設定、ポートレート、およびシネマティックモードを自動的にリセットせずに保持します。
kk: Параметрлерді автоматты түрде бастапқы күйіне қайтарудың орнына «Фото», «Портрет» және «Кино» режимі үшін айқындық тереңдігін сақтау.
kn: ಸ್ವಯಂಚಾಲಿತವಾಗಿ ರೀಸೆಟ್ ಮಾಡುವ ಬದಲು ಫೋಟೋ, ಪೋರ್ಟ್ರೇಟ್ ಮತ್ತು ಸಿನಿಮ್ಯಾಟಿಕ್ ಮೋಡ್‌ಗಳಿಗೆ ಡೆಪ್ತ್ ಸೆಟ್ಟಿಂಗ್ ಅನ್ನು ಉಳಿಸಿಕೊಳ್ಳಿ.
ko: 카메라를 자동으로 재설정하는 대신 사진, 인물 사진 및 시네마틱 모드에서 심도 설정을 유지합니다.
lt: Išsaugokite ir pritaikykite gylio nustatymą nuotraukos, portreto bei kinematografiniam režimams, užuot automatiškai nustatydami iš naujo.
ml: ഫോട്ടോ, പോർട്രെയ്റ്റ്, സിനിമാറ്റിക് എന്നീ മോഡുകൾക്കുള്ള ഡെപ്ത് ക്രമീകരണത്തെ ഓട്ടോമാറ്റിക്കായി റീസെറ്റ് ചെയ്യുന്നതിനു പകരം സംരക്ഷിക്കൂ.
mr: ऑटोमॅटिकली रीसेट करण्यापेक्षा, फोटो, पोर्ट्रेट, आणि सिनेमॅटिक मोडसाठी डेप्थ सेटिंग जतन करा.
ms: Kekalkan seting kedalaman untuk mod Foto, Potret dan Sinematik, berbanding mereset secara automatik.
nb: Bevar innstillingen for dybdeskarphet i modusene Bilde, Portrett og Filmatisk i stedet for å nullstille den automatisk.
nl: Bewaar de diepte-instelling voor de modi 'Foto', 'Portret' en 'Film', in plaats van deze automatisch opnieuw in te stellen.
or: ସ୍ବୟଂଚାଳିତ ଭାବରେ ରୀସେଟ୍ କରିବା ପରିବର୍ତ୍ତେ ଫଟୋ, ପୋର୍ଟ୍ରେଟ୍ ଏବଂ ସିନେମାଟିକ୍ ଡେପ୍‌ଥ୍‌ ପାଇଁ ଡେପ୍‌ଥ୍‌ ସେଟିଂ ସଂରକ୍ଷଣ କରନ୍ତୁ।
pa: ਆਟੋਮੈਟਿਕਲੀ ਰੀਸੈੱਟ ਕਰਨ ਦੀ ਬਜਾਏ ਤਸਵੀਰ, ਪੋਰਟ੍ਰੇਟ ਅਤੇ ਸਿਨੇਮੈਟਿਕ ਮੋਡ ਲਈ ਡੈਪਥ ਸੈਟਿੰਗ ਨੂੰ ਰੱਖਿਅਤ ਕਰੋ।
pl: Aplikacja zachowuje ostatnio użyte ustawienie trybów Zdjęcie, Portret i Filmowe, zamiast automatycznie je zerować.
pt_br: Preserve o ajuste de profundidade de campo nos modos Foto, Retrato e Cinema, em vez de redefini‑los automaticamente.
pt_pt: Manter a definição de profundidade para os modos Fotografia, Retrato e Cinematográfico, em vez de repor automaticamente.
ro: Va fi menținută configurarea de adâncime pentru modurile Foto, Portret și Cinematic, în locul resetării automate a acesteia.
ru: Сохранять настройку глубины резкости для режимов «Фото», «Портрет» и «Киноэффект», а не автоматически сбрасывать ее.
sk: Namiesto automatického resetovania zachová nastavenie hĺbky v režimoch Foto, Portrét a Film.
sl: Ohrani nastavitev globine za Fotografski in Portretni način ter način Filmsko, namesto da jih samodejno ponastavi.
sv: Behåll djupinställningarna för lägena Bild, Porträtt och Cinematisk istället för att automatiskt återställa.
ta: தன்னியக்கமாக மீட்டமைப்பதற்குப் பதிலாக ஃபோட்டோ, போர்ட்ரெய்ட், சினிமேட்டிக் பயன்முறை ஆகியவற்றிற்கான டெப்த் அமைப்பைத் தக்கவைக்கும்.
te: ఆటోమేటిక్‌గా రీసెట్ చేయడానికి బదులు, ఫోటో పోర్ట్రెయిట్ మరియు సినిమాటిక్ మోడ్‌ల కోసం డెప్త్ సెట్టింగ్‌ను భద్రపరుస్తుంది.
th: คงการตั้งค่าชัดลึกสำหรับโหมดรูปภาพ ภาพถ่ายบุคคล และภาพยนตร์ไว้แทนที่จะรีเซ็ตโดยอัตโนมัติ
tr: Fotoğraf, Portre ve Sinematik modları için derinlik ayarını otomatik olarak sıfırlamak yerine korur.
uk: Зберігати значення параметра глибини різкості в режимах «Фото», «Портрет», «Кінематограф» замість автоскидання.
ur: آٹومیٹک طریقے سے ری سیٹ کرنے کے بجائے تصویر، پورٹریٹ اور سنیمائی موڈ کے لیے ڈیپتھ سیٹنگ کو محفوظ کریں۔
vi: Bảo lưu cài đặt chiều sâu cho các chế độ Ảnh, Chân dung và Điện ảnh, thay vì tự động đặt lại.
zh_cn: 保留“照片”、“人像”和“电影效果”模式的景深设置，而非自动重设。
zh_hk: 保留「影相」、「人像」和「電影效果」模式的景深設定，而非自動重設。
zh_tw: 保留「拍照」、「人像」和「電影級」模式的景深設定，而非自動重置。

# CAM_PRESERVE_APERTURE_SWITCH
source: Depth Control
ar: التحكم في العمق
bg: Управление на дълбочината
bn: ডেপথ কন্ট্রোল
ca: Control de profunditat
cs: Ovládání hloubky ostrosti
da: Dybdekontrol
de: Tiefensteuerung
el: Έλεγχος βάθους
es: Control de profundidad
es_us: Control de profundidad
fi: Syvyyssäätö
fr: Commande de profondeur
fr_ca: Contrôle de profondeur
gu: ડેપ્થ કંટ્રોલ
he: בקרת עומק
hi: डेप्थ कंट्रोल
hr: Kontrola dubine
hu: Mélységvezérlés
id: Kontrol Kedalaman
it: Controllo profondità
ja: 被写界深度コントロール
kk: Тереңдікті басқару
kn: ಡೆಪ್ತ್ ಕಂಟ್ರೋಲ್
ko: 심도 제어
lt: Gylio valdymas
ml: ഡെപ്ത് നിയന്ത്രണം
mr: डेप्थ कंट्रोल
ms: Kawalan Kedalaman
nb: Behold dybdeskarphet
nl: Diepteregelaar
or: ଡେପ୍‌ଥ୍‌ କଣ୍ଟ୍ରୋଲ୍
pa: ਡੈਪਥ ਕੰਟਰੋਲ
pl: Kontrola głębi
pt_br: Controle de Profundidade de Campo
pt_pt: Controlo de profundidade
ro: Comandă adâncime
ru: Управление глубиной
sk: Ovládanie hĺbky
sl: Krmilna funkcija Globina
sv: Djupkontroll
ta: டெப்த் கட்டுப்பாடு
te: డెప్త్ కంట్రోల్
th: ควบคุมชัดลึก
tr: Derinlik Denetimi
uk: Контроль глибини різкості
ur: ڈیپتھ کنٹرول
vi: Điều khiển chiều sâu
zh_cn: 景深控制
zh_hk: 景深控制項目
zh_tw: 景深控制

# CAM_PRESERVE_AUTO_MACRO_FOOTER
source: Preserve the Auto Macro setting, rather than automatically using the Ultra Wide camera to capture macro photos and videos.
ar: الاحتفاظ بإعداد "ماكرو تلقائي"، بدلاً من استخدام الكاميرا العريضة جدًا تلقائيًا لالتقاط صور وفيديوهات ماكرو.
bg: Запазва настройката Автоматично макро, вместо автоматично да използва свръхширокоъгълната камера за заснемане на макроснимки и видеа.
bn: ম্যাক্রো ছবি এবং ভিডিও তুলতে স্বয়ংক্রিয়ভাবে আলট্রা ওয়াইড ক্যামেরা ব্যবহার করার পরিবর্তে অটো ম্যাক্রো সেটিংস সংরক্ষণ করুন।
ca: Conserva la configuració de macro automàtic en lloc d’utilitzar la càmera amb ultra gran angular per fer fotos i vídeos macro.
cs: Nastavení Automatické makro zůstane zachováno a při focení a natáčení videa v režimu makro se nebude automaticky používat ultraširokoúhlý fotoaparát.
da: Behold indstillingen Automatisk makro i stedet for automatisk at bruge ultravidvinkelkameraet til at tage makrofotos og optage makrovideoer.
de: Behalte die Auto-Makro-Einstellung bei, anstatt die Ultra Wide-Kamera automatisch für die Aufnahme von Makrofotos und -videos zu verwenden.
el: Διατήρηση της ρύθμισης «Αυτόματη μακρολήψη» αντί για αυτόματη χρήση της υπερευρείας κάμερας για λήψη μακροφωτογραφιών και βίντεο.
es: Para capturar fotos y vídeos en formato macro, activa el macro automático en vez de usar automáticamente la cámara con ultra gran angular.
es_us: Conserva la configuración de la función macro automática en lugar de usar automáticamente la cámara ultra gran angular para capturar videos y fotos macro.
fi: Älä vaihda automaattisesti ultralaajakulmakameraan makrokuvien ja -videoiden kuvaamista varten, vaan säilytä Automaattinen makro -asetus.
fr: Conservez le réglage Macro auto, plutôt que d’utiliser automatiquement la caméra ultra grand angle pour capturer des photos et des vidéos en mode macro.
fr_ca: Conserver le réglage Macro auto. plutôt que d’utiliser automatiquement la caméra très grand angle pour capturer des photos et des vidéos macro.
gu: મૅક્રો ફોટો અને વીડિયો કૅપ્ચર કરવા માટે અલ્ટ્રા વાઇડ કૅમેરાનો ઑટોમૅટિક રીતે ઉપયોગ કરવાને બદલે ઑટો મૅક્રો સેટિંગ ટકાવી રાખો.
he: ניתן לשמור את הגדרת ״מאקרו אוטומטי״, במקום להשתמש באופן אוטומטי במצלמה האולטרה-רחבה כדי לצלם תמונות וסרטונים במצב מאקרו.
hi: मैक्रो तस्वीरें और वीडियो कैप्चर करने के लिए अल्ट्रा वाइड कैमरे का ऑटोमैटिकली इस्तेमाल करने के बजाए ऑटो मैक्रो सेटिंग संरक्षित करें।
hr: Očuvanje Auto makro postavke umjesto automatske uporabe ultraširoke kamere za snimanje makro fotografija i videozapisa.
hu: Az Automatikus makró beállítás megtartása makrófotók és -videók készítéséhez az ultraszéles látószögű kamera automatikus használata helyett.
id: Pertahankan pengaturan Makro Otomatis alih-alih menggunakan kamera Ultra Lebar secara otomatis untuk mengambil foto dan video makro.
it: Mantieni l’impostazione “Macro automatica” anziché utilizzare automaticamente la fotocamera con ultra‑grandangolo per acquisire foto e video in macro.
ja: 写真とビデオをマクロ撮影するために超広角カメラを自動的に使用するのではなく、自動マクロ撮影設定を保持します。
kk: Макро фотолар мен видеоларға түсіру үшін ультра кең бұрышты камераға автоматты түрде ауысудың орнына, көрсетілген «Автомакро» параметрін сақтау.
kn: ಮ್ಯಾಕ್ರೋ ಫೋಟೋಗಳು ಮತ್ತು ವೀಡಿಯೊಗಳನ್ನು ಕ್ಯಾಪ್ಚರ್ ಮಾಡುವುದಕ್ಕಾಗಿ ಅಲ್ಟ್ರಾ ವೈಡ್ ಕ್ಯಾಮರಾವನ್ನು ಸ್ವಯಂಚಾಲಿತವಾಗಿ ಬಳಸುವ ಬದಲು ಆಟೋ ಮ್ಯಾಕ್ರೋ ಸೆಟ್ಟಿಂಗ್ ಅನ್ನು ಉಳಿಸಿಕೊಳ್ಳಿ.
ko: 접사 사진 및 비디오를 캡처하는 데 자동으로 울트라 와이드 카메라를 사용하는 대신 마지막으로 사용한 자동 접사 촬영 설정을 따릅니다.
lt: Išsaugokite nustatymą „Automatinis makrorežimas“, užuot automatiškai naudoję itin plataus objektyvo vaizdo kamerą makronuotraukoms ir vaizdo įrašams įrašyti.
ml: മാക്രോ ഫോട്ടോകളും വീഡിയോകളും കാപ്ചർ ചെയ്യാൻ അൾട്രാ വൈഡ് ക്യാമറ ഓട്ടോമാറ്റിക്കായി ഉപയോഗിക്കുന്നതിനു പകരം ഓട്ടോമാറ്റിക് മാക്രോ ക്രമീകരണത്തെ സംരക്ഷിക്കൂ.
mr: ऑटोमॅटिकली मॅक्रो फोटो आणि व्हिडिओ कॅप्चर करण्यासाठी अल्ट्रा वाइड कॅमेराचा वापर करण्यापेक्षा, ऑटो मॅक्रो सेटिंग जतन करा.
ms: Kekalkan seting Makro Auto, berbanding menggunakan kamera Ultralebar secara automatik untuk menangkap foto dan merakam video makro.
nb: Husk innstillingen Automatisk makro i stedet for å automatisk bruke kameraet med ultravidvinkel for makrofotografering og -videoopptak.
nl: Behoud de instelling 'Autom. macro' in plaats van automatisch de ultragroothoekcamera te gebruiken om macrofoto's en -video's te maken.
or: ମାକ୍ରୋ ଫଟୋ ଏବଂ ଭିଡିଓ କ‍୍ୟାପ୍‌ଚର୍ କରିବାପାଇଁ ଅଲ୍‌ଟ୍ରା ୱାଇଡ୍ କ୍ଯାମେରା ବ୍ଯବହାର କରିବା ପରିବର୍ତ୍ତେ ଅଟୋ ମାକ୍ରୋ ସେଟିଂ ସଂରକ୍ଷଣ କରନ୍ତୁ।
pa: ਮੈਕਰੋ ਤਸਵੀਰਾਂ ਅਤੇ ਵੀਡੀਓ ਨੂੰ ਕੈਪਚਰ ਕਰਨ ਲਈ ਅਲਟਰਾ ਵਾਈਡ ਕੈਮਰੇ ਦੀ ਆਟੋਮੈਟਿਕਲੀ ਵਰਤੋਂ ਕਰਨ ਦੀ ਬਜਾਏ ਆਟੋ ਮੈਕਰੋ ਸੈਟਿੰਗ ਨੂੰ ਰੱਖਿਅਤ ਕਰੋ।
pl: Aplikacja zachowuje ustawienie Automatyczne makro, zamiast automatycznie używać aparatu ultraszerokokątnego do zdjęć i wideo w trybie makro.
pt_br: Preserve o ajuste Macro Automático, em vez de usar automaticamente a câmera Ultra-Angular para capturar fotos e vídeos com macro.
pt_pt: Manter a definição Macro automaticamente, em vez de usar automaticamente a câmara ultra grande angular para capturar fotografias e vídeos macro.
ro: Va fi menținută configurarea Auto‑macro, în locul utilizării automate a camerei cu obiectiv ultra‑superangular pentru a realiza poze și clipuri video macro.
ru: Сохранять заданную настройку «Автомакро» вместо автоматического переключения на сверхширокоугольную камеру для макросъемки фото и видео.
sk: Zachová nastavenie Ovládanie makra namiesto automatického prepínania na ultraširokouhlú kameru pri záberoch zblízka.
sl: Ohrani nastavitev Samodejni makro, namesto da samodejno uporabi ultraširokokotno kamero za zajem makro fotografij in videov.
sv: Behåll inställningen för Automatiskt makro istället för att automatiskt använda ultravidvinkel­kameran till att ta makrobilder och spela in makrovideor.
ta: மேக்ரோ புகைப்படங்களையும் வீடியோக்களையும் எடுப்பதற்கு அல்ட்ரா வைடு கேமராவைத் தன்னியக்கமாகப் பயன்படுத்துவதற்குப் பதிலாக ஆட்டோ மேக்ரோ அமைப்பைத் தக்கவைக்கும்.
te: మ్యాక్రో ఫోటోలు మరియు వీడియోలను క్యాప్చర్ చేయడానికి అల్ట్రా వైడ్ కెమెరాను ఆటోమేటిక్‌గా ఉపయోగించడానికి బదులు ఆటో మ్యాక్రో సెట్టింగ్‌ను భద్రపరుస్తుంది.
th: คงการตั้งค่าออโต้มาโครไว้แทนที่จะเปลี่ยนกลับเป็นใช้กล้องอัลตร้าไวด์โดยอัตโนมัติเพื่อจับภาพและถ่ายวิดีโอแบบมาโคร
tr: Makro fotoğraf ve video çekmek için otomatik olarak Ultra Geniş kamerayı kullanmak yerine Otomatik Makro ayarını korur.
uk: Зберігати значення параметра автовмикання макрорежиму замість автоматичного використання надширококутної камери для створення фотографій і відеозаписів у макрорежимі.
ur: میکرو تصاویر اور ویڈیو کیپچر کرنے کے لیے الٹرا وائیڈ کیمرے کا آٹومیٹک طریقے سے استعمال کرنے کے بجائے آٹو میکرو سیٹنگ کو محفوظ کریں۔
vi: Bảo lưu cài đặt Macro tự động, thay vì tự động sử dụng camera cực rộng để chụp ảnh macro và quay video macro.
zh_cn: 保留自动微距设置，而非自动使用超广角相机拍摄微距照片和视频。
zh_hk: 保留「自動微距」設定，而非自動使用超廣角相機拍攝微距相片和影片。
zh_tw: 保留「自動微距」設定，而非自動切換到超廣角相機來拍攝微距照片和影片。

# CAM_PRESERVE_AUTO_MACRO_SWITCH
source: Auto Macro
ar: ماكرو تلقائي
bg: Автоматично макро
bn: অটো ম্যাক্রো
ca: Macro automàtic
cs: Automatické makro
da: Automatisk makro
de: Auto-Makro
el: Αυτόματη μακρολήψη
es: Macro automático
es_us: Macro automático
fi: Automaattinen makro
fr: Macro auto
fr_ca: Macro auto.
gu: ઑટો મૅક્રો
he: מאקרו אוטומטי
hi: ऑटो मैक्रो
hr: Auto makro
hu: Automatikus makró
id: Makro Otomatis
it: Macro automatica
ja: 自動マクロ撮影
kk: Автомакро
kn: ಆಟೋ ಮ್ಯಾಕ್ರೋ
ko: 자동 접사 촬영
lt: Automatinis makrorežimas
ml: ഓട്ടോ മാക്രോ
mr: ऑटो मॅक्रो
ms: Makro Auto
nb: Automatisk makro
nl: Autom. macro
or: ଅଟୋ ମାକ୍ରୋ
pa: ਆਟੋ ਮੈਕਰੋ
pl: Automatyczne makro
pt_br: Macro Automático
pt_pt: Macro automaticamente
ru: Автомакро
sk: Automatické makro
sl: Samodejni makro
sv: Automatiskt makro
ta: ஆட்டோ மேக்ரோ
te: ఆటో మ్యాక్రో
th: ออโต้มาโคร
tr: Otomatik Makro
uk: Автовмикати макрорежим
ur: آٹو میکرو
vi: Macro tự động
zh_cn: 自动微距
zh_hk: 自動微距
zh_tw: 自動微距
